Revit 2027 API
CurtainGridLine.AddAllSegments Method
All the segments on this grid line will be added.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddAllSegments()
Public Sub AddAllSegments
public:
void AddAllSegments()
member AddAllSegments : unit -> unit
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace